; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-4-4-2-4-4)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos1-0 pos1-1 pos1-2 pos1-3 pos2-0 pos2-1 pos2-2 pos2-3 pos3-0 pos3-1 pos3-2 pos3-3
    shape0 shape1
    key0 key1 key2 key3
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos3-0)
       (place pos3-1)
       (place pos3-2)
       (place pos3-3)
       (shape shape0)
       (shape shape1)
       (key key0)
       (key key1)
       (key key2)
       (key key3)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-2)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos2-0 pos3-0)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos3-1)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos3-2)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos3-3)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos3-0 pos3-1)
       (conn pos3-0 pos2-0)
       (conn pos3-1 pos3-2)
       (conn pos3-1 pos2-1)
       (conn pos3-1 pos3-0)
       (conn pos3-2 pos3-3)
       (conn pos3-2 pos2-2)
       (conn pos3-2 pos3-1)
       (conn pos3-3 pos2-3)
       (conn pos3-3 pos3-2)
       (locked pos2-0)
       (locked pos0-1)
       (locked pos1-2)
       (locked pos2-3)
       (lock-shape  pos2-0 shape0)
       (lock-shape  pos0-1 shape1)
       (lock-shape  pos1-2 shape0)
       (lock-shape  pos2-3 shape0)
       (open pos0-0)
       (open pos0-2)
       (open pos0-3)
       (open pos1-0)
       (open pos1-1)
       (open pos1-3)
       (open pos2-1)
       (open pos2-2)
       (open pos3-0)
       (open pos3-1)
       (open pos3-2)
       (open pos3-3)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape0)
       (key-shape  key3 shape1)
       (at key0 pos1-1)
       (at key1 pos0-3)
       (at key2 pos0-1)
       (at key3 pos3-3)
       (at-robot pos1-3)
    )

    (:goal (and
       (at key0 pos0-0)
       (at key1 pos0-1)
       (at key2 pos1-1)
       (at key3 pos0-1)
    )))

; plan
1. (move pos1-3 pos0-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos0-3)
   goals met: 0 of 4
2. (pickup pos0-3 key1)
   deleted: (at key1 pos0-3) (arm-empty)
   added: (holding key1)
   goals met: 0 of 4
3. (move pos0-3 pos0-2)
   deleted: (at-robot pos0-3)
   added: (at-robot pos0-2)
   goals met: 0 of 4
4. (unlock pos0-2 pos0-1 key1 shape1)
   deleted: (locked pos0-1)
   added: (open pos0-1)
   goals met: 0 of 4
5. (move pos0-2 pos0-1)
   deleted: (at-robot pos0-2)
   added: (at-robot pos0-1)
   goals met: 0 of 4
6. (putdown pos0-1 key1)
   deleted: (holding key1)
   added: (arm-empty) (at key1 pos0-1)
   goals met: 1 of 4
7. (move pos0-1 pos1-1)
   deleted: (at-robot pos0-1)
   added: (at-robot pos1-1)
   goals met: 1 of 4
8. (move pos1-1 pos2-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos2-1)
   goals met: 1 of 4
9. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 1 of 4
10. (move pos2-2 pos3-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos3-2)
   goals met: 1 of 4
11. (move pos3-2 pos3-3)
   deleted: (at-robot pos3-2)
   added: (at-robot pos3-3)
   goals met: 1 of 4
12. (pickup pos3-3 key3)
   deleted: (at key3 pos3-3) (arm-empty)
   added: (holding key3)
   goals met: 1 of 4
13. (move pos3-3 pos3-2)
   deleted: (at-robot pos3-3)
   added: (at-robot pos3-2)
   goals met: 1 of 4
14. (move pos3-2 pos2-2)
   deleted: (at-robot pos3-2)
   added: (at-robot pos2-2)
   goals met: 1 of 4
15. (move pos2-2 pos2-1)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-1)
   goals met: 1 of 4
16. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 1 of 4
17. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 1 of 4
18. (pickup-and-loose pos0-1 key2 key3)
   deleted: (holding key3) (at key2 pos0-1)
   added: (holding key2) (at key3 pos0-1)
   goals met: 2 of 4
19. (move pos0-1 pos1-1)
   deleted: (at-robot pos0-1)
   added: (at-robot pos1-1)
   goals met: 2 of 4
20. (pickup-and-loose pos1-1 key0 key2)
   deleted: (holding key2) (at key0 pos1-1)
   added: (holding key0) (at key2 pos1-1)
   goals met: 3 of 4
21. (move pos1-1 pos0-1)
   deleted: (at-robot pos1-1)
   added: (at-robot pos0-1)
   goals met: 3 of 4
22. (move pos0-1 pos0-0)
   deleted: (at-robot pos0-1)
   added: (at-robot pos0-0)
   goals met: 3 of 4
23. (putdown pos0-0 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos0-0)
   goals met: 4 of 4
